# TransactWithCentralOptions Class

---
Options to customize Revit behavior when accessing the central model.
SystemObject Autodesk.Revit.DBTransactWithCentralOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class TransactWithCentralOptions : IDisposable

    Public Class TransactWithCentralOptions
    	Implements IDisposable

    public ref class TransactWithCentralOptions : IDisposable

    type TransactWithCentralOptions =
        class
            interface IDisposable
        end
The TransactWithCentralOptions type exposes the following members.
| Name| Description
---|---|---
| TransactWithCentralOptions|  Constructs a new TransactWithCentralOptions.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the TransactWithCentralOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetLockCallback|  Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetLockCallback|  Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace